web/app/views/plans/show.html.erb

SELECT "participants".* FROM "participants" WHERE "participants"."plan_id" = 1
---
		</p>
		<% if @plan.participants.blank? %>