web/app/controllers/participants_controller.rb

SELECT "plans".* FROM "plans" WHERE "plans"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "participants" ("created_at", "plan_id", "points", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 16 Oct 2011 05:29:50 UTC +00:00], ["plan_id", 1], ["points", 0], ["updated_at", Sun, 16 Oct 2011 05:29:50 UTC +00:00], ["user_id", 1]]
---
  def create
    @participant.user = current_user
    @participant.plan = Plan.find_by_id(params[:plan_id])
    if @participant.plan.tentative
      @participant.points = 1
    end
    @participant.save
    flash[:notice] = t 'participants.message.create', :plan => @participant.plan.name

DELETE FROM "participants" WHERE "participants"."id" = ?  [["id", 6]]
---
  def destroy
    @participant.destroy