web/app/controllers/plans_controller.rb

  def index
    plans = Plan.all
---
SELECT "plans".* FROM "plans" WHERE (time IS NULL OR time > '2011-10-16 18:11:14.052261') ORDER BY time asc

  def create
    @plan.owner = current_user
    @plan.save
---
INSERT INTO "plans" ("created_at", "latitude", "link", "location", "longitude", "name", "sponsored", "tentative", "time", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @plan.update_attributes(params[:plan])
---
UPDATE "plans" SET "name" = 'Read A Heartbreaking Work of Staggering Genius', "location" = 'A Kick Ass Library', "updated_at" = '2011-10-16 14:44:22.642648' WHERE "plans"."id" = 1

  def destroy
    @plan.destroy
---
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 1]]