web/app/controllers/users_controller.rb

  def show
    if params[:id]
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "logi"]]